#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=43add1749d6d9832e0a8fca0784941273380c63a]
data.aws_ami.eks_default: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.company-example-eks.data.aws_partition.current: Reading...
module.EKSView.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/EKSView]
module.karpenter.data.aws_caller_identity.current: Reading...
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Reading...
module.ebs_csi_irsa.data.aws_caller_identity.current: Reading...
module.company-example-vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01a268e4d3d7b316c]
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.karpenter.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.company-example-eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.ebs_csi_irsa.data.aws_region.current: Reading...
module.company-example-eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/company-example/cluster]
module.ebs_csi_irsa.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.EKSAdmin.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/EKSAdmin]
module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.company-example-eks.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.ebs_csi_irsa.data.aws_partition.current: Reading...
module.ebs_csi_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/token.actions.githubusercontent.com]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.aws_iam_role.this[0]: Refreshing state... [id=company-example-cluster-20240527155546171000000001]
module.ebs_csi_irsa.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=212299854]
module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/AmazonEKS_EBS_CSI_Policy-20240527155546180800000003]
module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3462691479]
module.iam_github_oidc_role.aws_iam_role.this[0]: Refreshing state... [id=company-example-eks-admin]
module.company-example-eks.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.data.aws_iam_session_context.current: Reading...
module.company-example-eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::381491846999:user/jfotopoulos]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=company-example-cluster-20240527155546171000000001-20240527155547405300000008]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=company-example-cluster-20240527155546171000000001-20240527155547379900000007]
data.aws_ami.eks_default: Read complete after 0s [id=ami-00f34b6d2d1f002b0]
module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["EKSView"]: Refreshing state... [id=company-example-eks-admin-20240527155547789600000009]
module.company-example-eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e5940552ae0d3f7b]
module.company-example-vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02974879bf489be50]
module.company-example-vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0506229a0f3e252c6]
module.company-example-vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07f22851d830f435d]
module.company-example-vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ebc7678f1aa47ed5]
module.company-example-vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ef79faeb5b8ccd97]
module.company-example-vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e1d41cb642428c1f]
module.company-example-eks.aws_security_group.node[0]: Refreshing state... [id=sg-0233db421865ebc16]
module.company-example-vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07a9c3a7aa2880bf9]
module.company-example-vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c7cbfd9b9295a1a7]
module.company-example-vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d2ae836140af17ad]
module.company-example-vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-047c128defba94ffa]
module.company-example-vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0bd2b5b4d9c82815e]
module.company-example-vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0392affdc27261707]
module.company-example-vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a7b0cf9357f18d6a]
module.company-example-vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d2ae836140af17ad1080289494]
module.company-example-vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a69c5b33578f1b5e]
module.company-example-vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a88ba8645cfcb073]
module.company-example-vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01553c4c27e7fec65]
module.company-example-eks.aws_security_group_rule.node["egress_everywhere_allICMP"]: Refreshing state... [id=sgrule-295010310]
module.company-example-eks.aws_security_group_rule.node["egress_vpc_all"]: Refreshing state... [id=sgrule-1106289646]
module.company-example-eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-529038245]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2372147704]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2059681839]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1704281338]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3251300117]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4204336658]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2477339685]
module.company-example-eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-64649856]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1143373422]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2654479833]
module.company-example-eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3513547571]
module.company-example-eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-741762008]
module.company-example-eks.aws_security_group_rule.cluster["ingress_allow_vpc_to_kube_api"]: Refreshing state... [id=sgrule-2485767051]
module.company-example-vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03e96ae8af01bda17]
module.company-example-vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-060668b5777ad88f7]
module.company-example-vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a0c137e780a351be]
module.company-example-vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-04437e8ef9ce2651d]
module.company-example-vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-00a0f808b3300801c]
module.company-example-vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0ad761c91ff222e8d]
module.company-example-vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=company-example-vpc]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0cb3b71e4e6abd876]
module.company-example-eks.aws_eks_cluster.this[0]: Refreshing state... [id=company-example]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-2024052715554815000000000a]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c7cbfd9b9295a1a71080289494]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=karpenter-eks-node-group-2024052715554815000000000a-2024052715554849730000000c]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-2024052715554815000000000a-2024052715554851380000000e]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-2024052715554815000000000a-2024052715554850030000000d]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-2024052715554815000000000a-2024052715554847300000000b]
module.company-example-eks.aws_eks_access_entry.this["Admins"]: Refreshing state... [id=company-example:arn:aws:iam::381491846999:role/company-example-eks-admin]
module.company-example-eks.time_sleep.this[0]: Refreshing state... [id=2024-05-27T16:05:33Z]
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0f9a2847ec68bf8dc,Environment]
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0f9a2847ec68bf8dc,Project]
module.company-example-eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/50C4CD368992B423C60191917081324F]
module.company-example-eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=221029729295868410]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0c9c9635b559e9c3c]
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2573562295]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=3258564592]
module.ebs_csi_irsa.aws_iam_role.this[0]: Refreshing state... [id=ebs-csi]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20240527160503788200000010]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=company-example:karpenter-20240527160533987100000020]
module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=ebs-csi-20240527160504090700000011]
module.company-example-eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=company-example:vpc-cni]
module.company-example-eks.aws_eks_access_policy_association.this["Admins_admin"]: Refreshing state... [id=company-example#arn:aws:iam::381491846999:role/company-example-eks-admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.company-example-eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=company-example:aws-ebs-csi-driver]
module.company-example-eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=company-example:kube-proxy]
module.company-example-eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=company-example:coredns]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20240527160505204400000015]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20240527160505204900000017]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20240527160505201000000014]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20240527160505200100000013]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/381491846999/Karpenter-company-example]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-company-example-20240527160505204700000016]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-company-example-20240527160505204700000016-20240527160505474100000018]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-company-example-20240527160505204700000016-2024052716050550280000001a]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-company-example-20240527160505204700000016-20240527160505497200000019]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-company-example-20240527160505204700000016-2024052716050557960000001b]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2267436545]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/381491846999/Karpenter-company-example]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2294271275]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/KarpenterController-2024052716053185350000001c]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20240527160505200100000013-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20240527160505201000000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20240527160505204900000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20240527160505204400000015-KarpenterInterruptionQueueTarget]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=company-example:arn:aws:iam::381491846999:role/Karpenter-company-example-20240527160505204700000016]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20240527160503788200000010-2024052716053207690000001d]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.company-example-eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + version            = (known after apply)
    }

  # module.company-example-eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + version            = (known after apply)
    }

  # module.company-example-eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + version            = (known after apply)
    }

  # module.company-example-eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + version            = (known after apply)
    }

  # module.company-example-eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/50C4CD368992B423C60191917081324F"
    }

  # module.company-example-eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                        = "company-example"
        name                      = "company-example"
        tags                      = {
            "Environment"           = "dev"
            "Project"               = "Karpenter"
            "terraform-aws-modules" = "eks"
        }
        # (11 unchanged attributes hidden)

      ~ vpc_config {
          ~ endpoint_public_access    = false -> true
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.company-example-eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::381491846999:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/50C4CD368992B423C60191917081324F"
        tags            = {
            "Environment" = "dev"
            "Name"        = "company-example-eks-irsa"
            "Project"     = "Karpenter"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/artifacts/plan-output.txt

To perform exactly these actions, run the following command to apply:
    tofu apply "/tmp/artifacts/plan-output.txt"

```

</details>

*Pusher: @johnf-staybull, Action: `pull_request`, Working Directory: ``, Workflow: `opentofu-setup`*